title Conexi\u00F3n
file Archivo
info Info
cancel cancelar
close cerrar
about Acerca de
token token
name nombre
connect connectar
disconnect disconnectar
plugInInfo Conecta el robot con el pc usando el cable USB.
connectInfo Haz click ahora en \u00BBconnectar\u00AB para coenctar el robot con Open Roberta Lab.
tokenInfo Ahora puedes ingresar el token con copiar & pegar en men\u00FA robot - conectar... de Open Roberta Lab.
serverInfo Puedes empezar a enviar programas al robot. No olvide enchufar nuevamente el cable USB en el robot para enviar un nuevo programa.
attention Atenci\u00F3n
confirmCloseInfo Si cierra esta aplicaci\u00F3n su robot se desconectar\u00E1 de Open Roberta Lab.
httpErrorInfo Hay un problema con su conexi\u00F3n a Internet.
httpBrickInfo La conexi\u00F3n con su robot fue interrumpida.
aboutInfo Este programa es parte de The Open Roberta Lab, una plataforma de programaci\u00F3n open-source desarrolada por Fraunhofer IAIS dentro de la iniciativa \u00BBRoberta Learning with Robots\u00AB<br>Versi\u00F3n ${version}
updateInfo Hay un nuevo firmware disponible para su robot. Por favor actualice el robot ahora. Solo tiene que hacer click en \u00BBOK\u00AB y luego reiniciar el robot una vez que termine. ¡Sus programas y configuraci\u00F3nes se mantendr\u00E1n!
restartInfo }¡Actualizaci\u00F3n exitosa! Su robot podr\u00E1 utilizar el nuevo formware solo una vez que lo reinicie. Solo apague y prenda el robot, y recon\u00F3ctelo despu\u00F3s a Open Roberta Lab.
updateFail La actualizaci\u00F3n fall\u00F3, por favor int\u00E9ntelo nuevamente.
downloadFail La descarga del programa ha fallado, por favor int\u00E9ntelo nuevamente.
updateSuccess Actualizaci\u00F3n exitosa. ahora, por favor apague su robot y enci\u00E9ndalo nuevamente.
tokenTimeout Este token expir\u00F3. Haga click en \u00BBOK\u00AB y luego en \u00BBconnectar\u00AB para intentar nuevamente.
checkCustomDesc Mostrar opciones avanzadas
customDesc Direcci\u00F3n de servidor personalizada
ip IP:
port Puert:
scan escanear
listInfo Robots disponibles:
clearOutput Borrar salida
errorReadConfig Hay errores en el archivo arduino-ids.txt:
errorConfigVendorId Vendor ID no es un n\u00FAmero hexadecimal.
errorConfigProductId Product ID no es un n\u00FAmero hexadecimal.
errorConfigArduinoType El tipo de tarjeta arduino no est\u00E1 soportado.
errorConfigFormat Formato incorrecto.

version = ${version}
